app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-03 08:18:12.356213"], ["name", "HI"], ["updated_at", "2014-07-03 08:18:12.356213"]]
---
    def create # 创建用户
        @user = User.new(user_params)
        respond_to do |format|
            if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy # 删除
        @user.destroy